01Hub/fbedit/STM32F4Discovery/STM32F4_TVTerminal/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.0.0
* Date               : 14/08/2012
* Description        : Main program body
*******************************************************************************/

/*******************************************************************************
* PAL timing Horizontal
* H-sync         4,70uS
* Front porch    1,65uS
* Active video  51,95uS
* Back porch     5,70uS
* Line total     64,0uS
*
* |                64.00uS                   |
* |4,70|1,65|          51,95uS          |5,70|
*
*            ---------------------------
*           |                           |
*           |                           |
*           |                           |
*       ----                             ----
* |    |                                     |
* -----                                      ----
*
* PAL timing Vertical
* V-sync        0,576mS (9 lines)
* Frame         20mS (312,5 lines)
* Video signal  288 lines
*******************************************************************************/

/*******************************************************************************
* Port pins used
*
* Video out
* PA1   H-Sync and V-Sync
* PB15  Video out SPI2_MOSI
* RS232
* PA2   USART2 Tx
* PA3   USART2 Rx
* Keyboard
* PB0   Keyboard clock in
* PB1   Keyboard data in
* Leds
* PA9   Green
* PD5   Red
* PD12  Green
* PD13  Orange
* PD14  Red
* PD15  Blue
* User button
* PA0   User button
*******************************************************************************/

/*******************************************************************************
* Video output
*                  330
* PA1     O-------[  ]---o---------O  Video output
*                  1k0   |
* PB15    O-------[  ]---o
*                        |
*                       ---
*                       | |  82
*                       ---
*                        |
* GND     O--------------o---------O  GND
* 
*******************************************************************************/

/*******************************************************************************
* Keyboard connector 5 pin female DIN
*        2
*        o
*   4 o    o 5
*   1 o    o 3
* 
* Pin 1   CLK     Clock signal
* Pin 2   DATA    Data
* Pin 3   N/C     Not connected. Reset on older keyboards
* Pin 4   GND     Ground
* Pin 5   VCC     +5V DC
*******************************************************************************/

/*******************************************************************************
* Keyboard connector 6 pin female mini DIN
*
*   5 o    o 6
*   3 o    o 4
*    1 o o 2 
*
* Pin 1   DATA    Data
* Pin 2   N/C     Not connected.
* Pin 3   GND     Ground
* Pin 4   VCC     +5V DC
* Pin 5   CLK     Clock signal
* Pin 6   N/C     Not connected.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"
#include <stdio.h>
#include "Font8x10.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define TOP_MARGIN          30  // Number of lines before video signal starts
#define SCREEN_WIDTH        40  // 40 characters on each line.
#define SCREEN_HEIGHT       25  // 25 lines.
#define TILE_WIDTH          8   // Width of a character tile.
#define TILE_HEIGHT         10  // Height of a character tile.
#define SPI_DR              0x4001300C

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO uint16_t LineCount;
__IO uint16_t FrameCount;
uint8_t ScreenChars[SCREEN_HEIGHT][SCREEN_WIDTH];
uint8_t PixelBuff[SCREEN_WIDTH+2];

static uint8_t cx;
static uint8_t cy;
static uint8_t showcursor;

uint8_t rs232buff[256];
__IO uint8_t rs232tail;
__IO uint8_t rs232head;

__IO uint8_t tmpscancode;
__IO uint8_t scancode;
__IO uint8_t bitcount = 11;

extern uint8_t charbuf[256];
extern uint8_t charbuftail;
extern uint8_t charbufhead;

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void SPI_Config(void);
void DMA_Config(void);
void USART_Config(u16 Baud);
void video_show_cursor();
void video_hide_cursor();
void video_scrollup();
void video_cls();
void video_cfwd();
void video_lfwd();
void video_lf();
void video_putc(char c);
void video_puts(char *str);
void video_puthex(uint8_t n);
void * memmove(void *dest, void *source, uint32_t count);
void * memset(void *dest, uint32_t c, uint32_t count); 
static void CURSOR_INVERT() __attribute__((noinline));
void rs232_putc(char c);
void rs232_puts(char *str);
void decode(uint8_t scancode);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  uint16_t x,y;
  uint8_t c;
  y=0;
  c=0;
  while (y<SCREEN_HEIGHT)
  {
    x=0;
    while (x<SCREEN_WIDTH)
    {
      ScreenChars[y][x]=c;
      c++;
      x++;
    }
    y++;
  }

  RCC_Config();
  NVIC_Config();
  GPIO_Config();
  TIM_Config();
  SPI_Config();
  DMA_Config();
  USART_Config(4800);
  /* Enable TIM3 */
  TIM_Cmd(TIM3, ENABLE);
  STM_EVAL_LEDInit(LED3);
  /* Wait 200 frames */
  while (FrameCount<200)
  {
  }
  video_cls();
  FrameCount=0;

  while (1)
  {
    if (FrameCount==50)
    {
      FrameCount=0;
      STM_EVAL_LEDToggle(LED3);
      rs232_puts("Hi world\r\n\0");
    }
    while (rs232tail!=rs232head)
    {
      c=rs232buff[rs232tail++];
      video_putc(c);
    }
    while (charbuftail!=charbufhead)
    {
      c=charbuf[charbuftail++];
      rs232_putc(c);
    }
  }
}

static void CURSOR_INVERT()
{
  ScreenChars[cy][cx] ^= showcursor;
}

